---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyParallelTreadsAtEndFailure
source: html/7a9b8d4a-7674-30bf-dab0-2f9f352cbcff.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyParallelTreadsAtEndFailure Property

The number of parallel treads at end is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderTooManyParallelTreadsAtEndFailure { get; }
```